OF7/2.0/Tutorial/Fluid/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "wall.*"//wall_isolation//
    {
        type            noSlip;//fixedValue;//
        //value           uniform (0 0 0);
    }      
    outlet
    {
        type            zeroGradient;
        
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0.5);//0.15 
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
